import pandas as pd
import pytest


@pytest.fixture
def sample_data() -> dict:
    data = {
        "Дата операции": [
            "01.03.2019 12:00:00",
            "20.05.2019 03:00:00",
            "15.04.2019 15:30:00",
            "31.08.2019 20:00:00",
        ],
        "Сумма": [100, 200, 300, 400],
    }
    return data


@pytest.fixture
def sample_transact() -> pd.DataFrame:
    data = {
        "Дата операции": pd.to_datetime(
            ["2024-01-01", "2024-01-02", "2024-01-03", "2024-01-04", "2024-01-05", "2024-01-06"]
        ),
        "Сумма операции": [1000, 2000, 1500, 3000, 2500, 500],
        "Категория": ["Продукты", "Транспорт", "Развлечения", "Путешествия", "Кафе", "Магазин"],
        "Описание": ["Покупка в магазине", "Билет на автобус", "Кино", "Отпуск", "Обед", "Кофе"],
    }
    return pd.DataFrame(data)
